In [76]:
#import necessary libraries 
import pandas as pd 
import ast
import sklearn
import numpy as np

In [2]:
#loading all csv files
movies=pd.read_csv(r'movies_metadata.csv')
ratings=pd.read_csv(r'ratings_small.csv')
links=pd.read_csv(r'links_small.csv')

C:\Users\suman\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3020: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
#exploratory analysis of the movies_metadata dataframes
movies.head()

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0

In [4]:
#to do basic mathematics of movies_metadata
movies.describe()

            revenue       runtime  vote_average    vote_count
count  4.546000e+04  45203.000000  45460.000000  45460.000000
mean   1.120935e+07     94.128199      5.618207    109.897338
std    6.433225e+07     38.407810      1.924216    491.310374
min    0.000000e+00      0.000000      0.000000      0.000000
25%    0.000000e+00     85.000000      5.000000      3.000000
50%    0.000000e+00     95.000000      6.000000     10.000000
75%    0.000000e+00    107.000000      6.800000     34.000000
max    2.787965e+09   1256.000000     10.000000  14075.000000

In [5]:
#to find basic info of movies_metadata
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 24 columns):
adult                    45466 non-null object
belongs_to_collection    4494 non-null object
budget                   45466 non-null object
genres                   45466 non-null object
homepage                 7782 non-null object
id                       45466 non-null object
imdb_id                  45449 non-null object
original_language        45455 non-null object
original_title           45466 non-null object
overview                 44512 non-null object
popularity               45461 non-null object
poster_path              45080 non-null object
production_companies     45463 non-null object
production_countries     45463 non-null object
release_date             45379 non-null object
revenue                  45460 non-null float64
runtime                  45203 non-null float64
spoken_languages         45460 non-null object
status                   45379 non-null object
tagline                  20412 non-null object
title                    45460 non-null object
video                    45460 non-null object
vote_average             45460 non-null float64
vote_count               45460 non-null float64
dtypes: float64(4), object(20)
memory usage: 8.3+ MB

In [6]:
#to check null values in movies_metadata
movies.isnull().sum()

adult                        0
belongs_to_collection    40972
budget                       0
genres                       0
homepage                 37684
id                           0
imdb_id                     17
original_language           11
original_title               0
overview                   954
popularity                   5
poster_path                386
production_companies         3
production_countries         3
release_date                87
revenue                      6
runtime                    263
spoken_languages             6
status                      87
tagline                  25054
title                        6
video                        6
vote_average                 6
vote_count                   6
dtype: int64

In [7]:
#exploratory analysis of the linked_small dataframe
links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [8]:
#to check basic info of links dataframe
links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9125 entries, 0 to 9124
Data columns (total 3 columns):
movieId    9125 non-null int64
imdbId     9125 non-null int64
tmdbId     9112 non-null float64
dtypes: float64(1), int64(2)
memory usage: 213.9 KB

In [9]:
#to do basic mathematics
links.describe()

             movieId        imdbId         tmdbId
count    9125.000000  9.125000e+03    9112.000000
mean    31123.291836  4.798244e+05   39104.545544
std     40782.633604  7.431774e+05   62814.519801
min         1.000000  4.170000e+02       2.000000
25%      2850.000000  8.884600e+04    9451.750000
50%      6290.000000  1.197780e+05   15852.000000
75%     56274.000000  4.284410e+05   39160.500000
max    164979.000000  5.794766e+06  416437.000000

In [10]:
#to check null vallues in links dataframe
links.isnull().sum()

movieId     0
imdbId      0
tmdbId     13
dtype: int64

In [11]:
#exploratory analysis of the ratings dataframe
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [12]:
#to check basic info
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100004 entries, 0 to 100003
Data columns (total 4 columns):
userId       100004 non-null int64
movieId      100004 non-null int64
rating       100004 non-null float64
timestamp    100004 non-null int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [13]:
#to do basic mathmatics
ratings.describe()

              userId        movieId         rating     timestamp
count  100004.000000  100004.000000  100004.000000  1.000040e+05
mean      347.011310   12548.664363       3.543608  1.129639e+09
std       195.163838   26369.198969       1.058064  1.916858e+08
min         1.000000       1.000000       0.500000  7.896520e+08
25%       182.000000    1028.000000       3.000000  9.658478e+08
50%       367.000000    2406.500000       4.000000  1.110422e+09
75%       520.000000    5418.000000       4.000000  1.296192e+09
max       671.000000  163949.000000       5.000000  1.476641e+09

In [14]:
#to check null values
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [24]:
#data cleaning checking null values in md dataframe
from pandas.api.types import is_numeric_dtype
is_numeric_dtype(movies['id'])

False

In [25]:
#the above type reult is false it means id coulmn some object or string value and to convert them in int type 
#we need to drop particular id from dataframe and again convert md data id column into integer
movies=movies.drop([19730,29503,35587])
movies['id']=movies['id'].astype('int')
movies['id'].head(10)

0      862
1     8844
2    15602
3    31357
4    11862
5      949
6    11860
7    45325
8     9091
9      710
Name: id, dtype: int32

In [53]:

#first task is to merge both the dataframe links and ratings using merge function on 'movieId'
cleaned_data=pd.merge(links,ratings,on='movieId')

In [54]:
#to show 3 rows of merged data
cleaned_data.head(3)

   movieId  imdbId  tmdbId  userId  rating   timestamp
0        1  114709   862.0       7     3.0   851866703
1        1  114709   862.0       9     4.0   938629179
2        1  114709   862.0      13     5.0  1331380058

In [55]:
#tocheck null values in cleaned data
cleaned_data.isnull().sum()

movieId       0
imdbId        0
tmdbId       71
userId        0
rating        0
timestamp     0
dtype: int64

In [56]:
cleaned_data['tmdbId']=cleaned_data['tmdbId'].fillna(0)

In [57]:
#to check null value in links_small and converting into int type
cleaned_data['tmdbId']=cleaned_data['tmdbId'].astype('int')

In [58]:
# checking again
cleaned_data.isnull().sum()

movieId      0
imdbId       0
tmdbId       0
userId       0
rating       0
timestamp    0
dtype: int64

In [59]:
#to check cleaned dataframe is of int type or not
is_numeric_dtype(cleaned_data)

False

In [60]:
#merging cleaned_data with movies data frame
cleaned_data=cleaned_data.merge(movies,left_on='movieId', right_on='id')

In [61]:
#Make a pivot table and name it as wrangled_data using cleaned_data dataframe 
#where index or value of row is set to title column, columns value holds the userId
#and value of each cell is the ratings given by user.
#Fill the NaN values with 0.
wrangled_data=pd.pivot_table(cleaned_data,index='title',columns='userId',values='rating').fillna(0)

In [62]:
wrangled_data.head()

userId,1,2,3,4,5,6,7,8,9,10,...,662,663,664,665,666,667,668,669,670,671
title,,,,,,,,,,,,,,,,,,,,,
!Women Art Revolution,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
'Gator Bait,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
'Twas the Night Before Christmas,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...And God Created Woman,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
00 Schneider - Jagd auf Nihil Baxter,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [64]:
#Analyse the wrangled_data and justify the results.
#Pass all the values of wrangled_data into csr_matrix function of scipy package
#and store result back into mat_movie_features variable.
from scipy.sparse import csr_matrix

In [65]:
mat_movie=csr_matrix(wrangled_data.values)

In [66]:
mat_movie

<2794x671 sparse matrix of type '<class 'numpy.float64'>'
	with 44845 stored elements in Compressed Sparse Row format>

In [67]:
print(mat_movie)

  (0, 72)	3.0
  (0, 401)	3.5
  (1, 14)	0.5
  (2, 72)	4.5
  (2, 156)	3.5
  (3, 546)	4.0
  (4, 298)	3.5
  (4, 546)	4.5
  (5, 14)	3.0
  (5, 22)	4.0
  (5, 130)	4.0
  (5, 131)	4.5
  (5, 282)	5.0
  (5, 362)	4.0
  (5, 426)	5.0
  (5, 451)	4.0
  (5, 546)	5.0
  (5, 557)	5.0
  (5, 575)	4.0
  (6, 29)	3.0
  (6, 127)	4.0
  (6, 149)	3.0
  (6, 261)	1.0
  (6, 262)	2.0
  (6, 460)	2.5
  :	:
  (2789, 474)	2.5
  (2789, 480)	2.0
  (2789, 518)	4.5
  (2789, 546)	2.5
  (2789, 560)	4.0
  (2789, 573)	3.5
  (2789, 598)	4.5
  (2789, 619)	3.0
  (2790, 546)	4.0
  (2791, 14)	0.5
  (2791, 101)	4.0
  (2791, 118)	4.0
  (2791, 284)	4.0
  (2791, 298)	4.5
  (2791, 387)	3.0
  (2791, 406)	4.0
  (2791, 407)	5.0
  (2791, 471)	3.0
  (2791, 488)	3.0
  (2791, 527)	3.0
  (2791, 563)	3.0
  (2791, 607)	4.0
  (2791, 664)	1.0
  (2792, 16)	4.5
  (2793, 467)	4.5

In [70]:
#Use the NearestNeighbors functionality under sklearn package and make an
#instance of it keeping metric equals to cosine and algorithm as brute.
from sklearn.neighbors import NearestNeighbors
model_knn=NearestNeighbors(metric='cosine',algorithm='brute')

In [71]:
model_knn

NearestNeighbors(algorithm='brute', leaf_size=30, metric='cosine',
         metric_params=None, n_jobs=None, n_neighbors=5, p=2, radius=1.0)

In [72]:
#to show the total number of rows in wrangled data 0 specify for rows
wrangled_data.shape[0]

2794

In [81]:
#now building a collabaration recommender function Inside the function choose a random number which is less than the number of
#rows available in wrangled_data and store it into query_index.
def collaboration_recommender():
    query_index=np.random.choice(wrangled_data.shape[0])
    model_knn.fit(mat_movie)
    print('the query index is :' , query_index)
    distances , indicies = model_knn.kneighbors(wrangled_data.iloc[query_index, :].values.reshape(1,-1),n_neighbors=20)
    for i in range(0,len(distances.flatten())):
        if i==0:
            print("Recommendation for the movie : [0]\n".format(wrangled_data.index[query_index]))
        else:
                print('{0}'.format(wrangled_data.index[indicies.flatten()[i]]))

In [82]:
collaboration_recommender()

the query index is : 77
Recommendation for the movie : [0]

The Great Spy Chase
Prep & Landing
Like Mike 2: Streetball
The Other Side of the Mountain: Part II
Mirror Mirror
Look Back in Anger
De Dominee
Orfeu
The Era of Vampires
Dracula
The Teacher
The Incredible Shrinking Man
Wayne's World
A Slit-Mouthed Woman
A Christmas Tale
The Art of Love
It's Hard Being Loved by Jerks
Love Jones
A Common Thread

In [85]:

def collaboration():
    user_input=int(input('enter the index number between 0 to 2794:'))
    query_index=user_input
    model_knn.fit(mat_movie)
    print('the query index is :' , query_index)
    distances , indicies = model_knn.kneighbors(wrangled_data.iloc[query_index, :].values.reshape(1,-1),n_neighbors=20)
    for i in range(0,len(distances.flatten())):
        if i==0:
            print("Recommendation for the movie : [0]\n".format(wrangled_data.index[query_index]))
        else:
                print('{0}'.format(wrangled_data.index[indicies.flatten()[i]]))

In [86]:
collaboration()

enter the index number between 0 to 2794:567
the query index is : 567
Recommendation for the movie : [0]

Spirited Away
I Now Pronounce You Chuck & Larry
Chi lavora Ã¨ perduto
The Devil's Own
On Top of the Whale
At Point Blank
Silent Night, Deadly Night 5: The Toy Maker
Moonshine County Express
The Diary of Anne Frank
The Monster
Catching Hell
The Touch
Angels and Insects
An Unforgettable Summer
Canvas
Amos & Andrew
The Mountain Road
Corpse Bride
Don't Look Now: We're Being Shot At